; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	spectrograph2 - mode
	spectrograph7 - mode
	image4 - mode
	spectrograph1 - mode
	infrared3 - mode
	infrared0 - mode
	image6 - mode
	infrared5 - mode
	Star0 - direction
	GroundStation3 - direction
	Star1 - direction
	Star4 - direction
	GroundStation2 - direction
	GroundStation5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Star9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 image6)
	(supports instrument0 infrared5)
	(supports instrument0 image4)
	(supports instrument0 spectrograph1)
	(supports instrument0 spectrograph7)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet8)
	(supports instrument1 infrared0)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 Star4)
	(calibration_target instrument1 Star1)
	(supports instrument2 spectrograph2)
	(supports instrument2 image6)
	(supports instrument2 infrared0)
	(supports instrument2 infrared3)
	(calibration_target instrument2 GroundStation5)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star9)
)
(:goal (and
	(pointing satellite0 Star1)
	(pointing satellite1 GroundStation2)
	(have_image Phenomenon6 spectrograph7)
	(have_image Phenomenon7 image4)
	(have_image Phenomenon7 infrared5)
	(have_image Planet8 infrared0)
	(have_image Planet8 spectrograph2)
	(have_image Star9 spectrograph2)
	(have_image Star10 image6)
	(have_image Phenomenon11 infrared3)
	(have_image Phenomenon11 image6)
	(have_image Phenomenon12 spectrograph2)
	(have_image Phenomenon12 infrared0)
	(have_image Planet13 infrared0)
	(have_image Planet13 spectrograph7)
))

)

; plan
1. (turn_to satellite1 groundstation2 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 groundstation2)
   goals met: 1 of 15
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 15
3. (calibrate satellite1 instrument2 groundstation2)
   added: (calibrated instrument2)
   goals met: 1 of 15
4. (turn_to satellite1 planet8 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 planet8)
   goals met: 0 of 15
5. (take_image satellite1 planet8 instrument2 spectrograph2)
   added: (have_image planet8 spectrograph2)
   goals met: 1 of 15
6. (take_image satellite1 planet8 instrument2 infrared0)
   added: (have_image planet8 infrared0)
   goals met: 2 of 15
7. (turn_to satellite1 phenomenon12 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 phenomenon12)
   goals met: 2 of 15
8. (take_image satellite1 phenomenon12 instrument2 spectrograph2)
   added: (have_image phenomenon12 spectrograph2)
   goals met: 3 of 15
9. (take_image satellite1 phenomenon12 instrument2 infrared0)
   added: (have_image phenomenon12 infrared0)
   goals met: 4 of 15
10. (turn_to satellite1 phenomenon11 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 phenomenon11)
   goals met: 4 of 15
11. (turn_to satellite0 star1 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star1)
   goals met: 5 of 15
12. (take_image satellite1 phenomenon11 instrument2 infrared3)
   added: (have_image phenomenon11 infrared3)
   goals met: 6 of 15
13. (take_image satellite1 phenomenon11 instrument2 image6)
   added: (have_image phenomenon11 image6)
   goals met: 7 of 15
14. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 7 of 15
15. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 7 of 15
16. (turn_to satellite0 phenomenon6 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon6)
   goals met: 6 of 15
17. (take_image satellite0 phenomenon6 instrument0 spectrograph7)
   added: (have_image phenomenon6 spectrograph7)
   goals met: 7 of 15
18. (turn_to satellite0 phenomenon7 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon7)
   goals met: 7 of 15
19. (take_image satellite0 phenomenon7 instrument0 image4)
   added: (have_image phenomenon7 image4)
   goals met: 8 of 15
20. (take_image satellite0 phenomenon7 instrument0 infrared5)
   added: (have_image phenomenon7 infrared5)
   goals met: 9 of 15
21. (turn_to satellite0 planet13 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 planet13)
   goals met: 9 of 15
22. (take_image satellite0 planet13 instrument0 spectrograph7)
   added: (have_image planet13 spectrograph7)
   goals met: 10 of 15
23. (turn_to satellite0 star1 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 star1)
   goals met: 11 of 15
24. (turn_to satellite1 planet13 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 planet13)
   goals met: 11 of 15
25. (take_image satellite1 planet13 instrument2 infrared0)
   added: (have_image planet13 infrared0)
   goals met: 12 of 15
26. (turn_to satellite1 star10 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 star10)
   goals met: 12 of 15
27. (take_image satellite1 star10 instrument2 image6)
   added: (have_image star10 image6)
   goals met: 13 of 15
28. (turn_to satellite1 star9 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star9)
   goals met: 13 of 15
29. (take_image satellite1 star9 instrument2 spectrograph2)
   added: (have_image star9 spectrograph2)
   goals met: 14 of 15
30. (turn_to satellite1 groundstation2 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 groundstation2)
   goals met: 15 of 15
